In [1]:
import csv 
import json 
import pandas as pd
pd.set_option("display.max_columns", None)

In [2]:
df = pd.read_csv("hr_raw_data_2023.csv", index_col=0)
df['department']

age
51                         NaN
52                         NaN
42     Research & Development
47                         NaN
46                         NaN
                ...
43                         NaN
47                         NaN
29                         NaN
47                         NaN
32                         NaN
Name: department, Length: 1678, dtype: object

In [3]:
df['salary']

age
51                                           195370,00$
52                                           199990,00$
42                                           192320,00$
47                                           171690,00$
46    12783,92$12783,92$12783,92$12783,92$12783,92$1...
                            ...
43    3949,17$3949,17$3949,17$3949,17$3949,17$3949,1...
47                                           191324,62$
29                                            28111,13$
47                                           100071,84$
32                                            53914,11$
Name: salary, Length: 1678, dtype: object

In [4]:
# Divide por el símbolo $
df['salary'] = df['salary'].str.split('$')

# Extraer lo que está antes
df['salary'] = df['salary'].str[0]

In [5]:
df['salary']

age
51    195370,00
52    199990,00
42    192320,00
47    171690,00
46     12783,92
        ...
43      3949,17
47    191324,62
29     28111,13
47    100071,84
32     53914,11
Name: salary, Length: 1678, dtype: object

In [11]:
df['department'].unique()

array([nan, ' Research & Development ', ' Sales ', ' Human Resources '],
      dtype=object)

In [12]:
df['department'].isnull().sum()

1366

In [13]:
df['education'].unique()

array([3, 4, 2, 1, 5], dtype=int64)

In [14]:
df['education'].isnull().sum()

0

In [17]:
df.columns

Index(['attrition', 'businesstravel', 'dailyrate', 'department',
       'distancefromhome', 'education', 'educationfield', 'employeenumber',
       'environmentsatisfaction', 'gender', 'jobinvolvement', 'joblevel',
       'jobrole', 'jobsatisfaction', 'maritalstatus', 'monthlyincome',
       'monthlyrate', 'numcompaniesworked', 'overtime', 'percentsalaryhike',
       'performancerating', 'relationshipsatisfaction', 'standardhours',
       'stockoptionlevel', 'totalworkingyears', 'trainingtimeslastyear',
       'worklifebalance', 'yearsatcompany', 'yearsincurrentrole',
       'yearssincelastpromotion', 'yearswithcurrmanager', 'datebirth',
       'salary', 'roledepartament', 'numberchildren', 'remotework', 'fin'],
      dtype='object')

In [19]:
df['environmentsatisfaction'].unique()

array([ 1,  3,  4,  2, 42, 37, 35, 25, 27, 31, 39, 21, 15, 14, 33, 19, 12,
       13, 28, 47, 36, 29, 24, 46, 16, 22, 41, 49, 11, 48, 18, 10, 45, 38,
       17, 20, 26, 43], dtype=int64)

In [23]:
import re

In [24]:
columna = df['environmentsatisfaction']
patron = \d+(\.\d+)?

def numero(number):
    if number == patron:
        pass
    else:
        return patron

SyntaxError: unexpected character after line continuation character (39715220.py, line 2)

In [32]:
df["enviromentsatisfactionunique"] = df["environmentsatisfaction"].astype(str).str[0].astype(int)
df['enviromentsatisfactionunique']

age
51    1
52    3
42    3
47    1
46    1
     ..
43    2
47    4
29    3
47    3
32    4
Name: enviromentsatisfactionunique, Length: 1678, dtype: int32

In [33]:
df['enviromentsatisfactionunique'].unique()

array([1, 3, 4, 2])

In [48]:
df = df.drop('environmentsatisfaction', axis=1)

In [65]:
df.columns

Index(['attrition', 'businesstravel', 'dailyrate', 'department',
       'distancefromhome', 'education', 'educationfield', 'employeenumber',
       'gender', 'jobinvolvement', 'joblevel', 'jobrole', 'jobsatisfaction',
       'maritalstatus', 'monthlyincome', 'monthlyrate', 'numcompaniesworked',
       'overtime', 'percentsalaryhike', 'performancerating',
       'relationshipsatisfaction', 'standardhours', 'stockoptionlevel',
       'totalworkingyears', 'trainingtimeslastyear', 'worklifebalance',
       'yearsatcompany', 'yearsincurrentrole', 'yearssincelastpromotion',
       'yearswithcurrmanager', 'datebirth', 'salary', 'roledepartament',
       'numberchildren', 'remotework', 'fin', 'primer_digito',
       'environmentsatisfaction'],
      dtype='object')

In [64]:
df = df.rename(columns={'enviromentsatisfaction': 'environmentsatisfaction'})

In [71]:
df['monthlyincome']

age
51    16280.83
52         NaN
42         NaN
47    14307.50
46    12783.92
        ...
43     3949.17
47    15943.72
29         NaN
47     8339.32
32         NaN
Name: monthlyincome, Length: 1678, dtype: float64

In [9]:
df['monthlyincome'] = df['monthlyincome'].str.replace('$', '', regex=False)

In [10]:

df['monthlyincome'] = df['monthlyincome'].str.replace(',', '.', regex=False)
df['monthlyincome'] = df['monthlyincome'].astype(float)

In [7]:
df['salary']

age
51    195370.00
52    199990.00
42    192320.00
47    171690.00
46     12783.92
        ...
43      3949.17
47    191324.62
29     28111.13
47    100071.84
32     53914.11
Name: salary, Length: 1678, dtype: float64

In [77]:
df[['monthlyincome', 'monthlyrate', 'salary']]

,monthlyincome,monthlyrate,salary
age,,,
51,16280.83,42330.17,195370.00
52,NaN,43331.17,199990.00
42,NaN,41669.33,192320.00
47,14307.50,37199.50,171690.00
46,12783.92,33238.20,12783.9212783.9212783.9212783.9212783.9212783....
...,...,...,...
43,3949.17,10267.83,3949.173949.173949.173949.173949.173949.173949...
47,15943.72,41453.67,191324.62
29,NaN,6090.75,28111.13
47,8339.32,21682.23,100071.84
32,NaN,11681.39,53914.11

In [82]:
df[['monthlyincome', 'salary']]

     monthlyincome                                             salary
age
51        16280.83                                          195370.00
52             NaN                                          199990.00
42             NaN                                          192320.00
47        14307.50                                          171690.00
46        12783.92  12783.9212783.9212783.9212783.9212783.9212783....
..             ...                                                ...
43         3949.17  3949.173949.173949.173949.173949.173949.173949...
47        15943.72                                          191324.62
29             NaN                                           28111.13
47         8339.32                                          100071.84
32             NaN                                           53914.11

[1678 rows x 2 columns]

In [18]:
df["monthlyincome"] = df["monthlyincome"].fillna(df["salary"] / 12)

In [20]:
df['monthlyincome'].isnull().sum()

0

In [21]:
df['monthlyrate']

age
51    42330.17
52    43331.17
42    41669.33
47    37199.50
46    33238.20
        ...
43    10267.83
47    41453.67
29     6090.75
47    21682.23
32    11681.39
Name: monthlyrate, Length: 1678, dtype: float64

In [28]:
df.columns

Index(['attrition', 'businesstravel', 'dailyrate', 'department',
       'distancefromhome', 'education', 'educationfield', 'employeenumber',
       'environmentsatisfaction', 'gender', 'jobinvolvement', 'joblevel',
       'jobrole', 'jobsatisfaction', 'maritalstatus', 'monthlyincome',
       'monthlyrate', 'numcompaniesworked', 'overtime', 'percentsalaryhike',
       'performancerating', 'relationshipsatisfaction', 'standardhours',
       'stockoptionlevel', 'totalworkingyears', 'trainingtimeslastyear',
       'worklifebalance', 'yearsatcompany', 'yearsincurrentrole',
       'yearssincelastpromotion', 'yearswithcurrmanager', 'datebirth',
       'salary', 'roledepartament', 'numberchildren', 'remotework', 'fin'],
      dtype='object')